# 1) Создать переменную типа String
v_str = "Name"
print(v_str, type(v_str))
# 2) Создать переменную типа Integer
v_int = 123
print(v_int, type(v_int))
# 3) Создать переменную типа Float
v_float = 12.3
print(v_float, type(v_float))
# 4) Создать переменную типа Bytes
v_bytes = b'bytes'
print(v_bytes, type(v_bytes))
# 5) Создать переменную типа List
v_list = list("список")
print(v_list, type(v_list))
# 6) Создать переменную типа Tuple
v_tuple = tuple('hello, world!')
print(v_tuple, type(v_tuple))
# 7) Создать переменную типа Set
v_set = set('hello')
print(v_set, type(v_set))
# 8) Создать переменную типа Frozen set
v_frozenset = frozenset('no_change')
print(v_frozenset, type(v_frozenset))
# 9) Создать переменную типа Dict
v_dict = {'apple': 1, 'pear': 2}
print(v_dict, type(v_dict))

# 11) Создать 2 переменные String,
# создать переменную в которой суммируете эти переменные. Вывести в консоль.
name_1 = "Misha"
name_2 = "Denis"
print("Misha "+"Denis")
# 12) Создать 2 переменные Integer,
# создать переменную в которой суммируете эти переменные. Вывести в консоль.
age_1 = 23
age_2 = 32
print(23+32)
# 13) Создать переменную в которой Разделите эти переменные Int. Вывести в консоль.
print(age_1/age_2)
# 14) Создать переменную в которой Умножите эти переменные Int. Вывести в консоль.
print(age_1*age_2)
# 15) Создать переменную в которой Разделите без остатка эти переменные Int. Вывести в консоль.
print(age_1//age_2)
# 16) Создать переменную
# в которой надо присвоить остаток от деления этих переменные Int. Вывести в консоль.
print(age_1 % age_2)

